FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC17xx_40xx/LPC17xx_40xx_I2C.c
static const T_LPC17xx_40xx_IOCON_ConfigList G_sda2[] = {
        {GPIO_P0_10, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P1_15, IOCON_D(3, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P2_30, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P4_20, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
};
static const T_LPC17xx_40xx_IOCON_ConfigList G_scl2[] = {
        {GPIO_P0_11, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P2_31, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P4_21, IOCON_D(2, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
        {GPIO_P4_29, IOCON_D(4, IOCON_NO_PULL, IOCON_HYS_DISABLE,
                IOCON_INVERT_OFF, IOCON_SLEW_STANDARD, IOCON_OPEN_DRAIN)},
};

/*-------------------------------------------------------------------------*
 * Function Prototypes:
 *-------------------------------------------------------------------------*/
IRQ_ROUTINE(ILPC17xx_40xx_I2C0InterruptHandler)
;
IRQ_ROUTINE(ILPC17xx_40xx_I2C1InterruptHandler)
;
IRQ_ROUTINE(ILPC17xx_40xx_I2C2InterruptHandler)
;
void ILPC17xx_40xx_ProcessState(T_LPC17xx_40xx_I2C_Workspace *p);

/*-------------------------------------------------------------------------*/
#if 0 // COMPILE_I2C_SLAVE_MODE
static TBool ILPC17xx_40xx_I2CSlaveIsLastReceiveByte(T_LPC17xx_40xx_I2C_Workspace *aWorkspace)
{
    if (aWorkspace->iIndex >= aWorkspace->iDataLen)
    return ETrue;
    return EFalse;
}

static TBool ILPC17xx_40xx_I2CSlaveIsLastTransmitByte(T_LPC17xx_40xx_I2C_Workspace *aWorkspace)
{
    if (aWorkspace->iIndex >= aWorkspace->iDataLen)
    return ETrue;
    return EFalse;
}

static void ILPC17xx_40xx_I2CTransferComplete(T_LPC17xx_40xx_I2C_Workspace *aWorkspace)
{
    // Do nothing
    //    PARAM_NOT_USED(aWorkspace);
}

static void ILPC17xx_40xx_I2CSlaveReceiveByte(T_LPC17xx_40xx_I2C_Workspace *aWorkspace, TUInt8 aByte)
{
    // Only store if there is room
    if (aWorkspace->iIndex < aWorkspace->iDataLen)
    aWorkspace->iData[aWorkspace->iIndex] = aByte;
}

static TUInt8 ILPC17xx_40xx_I2CSlaveGetTransmitByte(T_LPC17xx_40xx_I2C_Workspace *aWorkspace)
{
    // Only read from memory if in bounds
    if (aWorkspace->iIndex < aWorkspace->iDataLen)
    return aWorkspace->iData[aWorkspace->iIndex];
    return 0;
}
#endif

void ILPC17xx_40xx_I2CSetSpeed(LPC_I2C_TypeDef *aRegs, TUInt16 aSpeed)
{
    // Calculate the speed value to use
    TUInt16 v;

    // Calculate from kHz to cycles (based on PCLK)
    v = (PCLK_FREQUENCY / 1000) / aSpeed;

    if (aSpeed == 400){
    // Set 44.6%/55.3% duty cycle to satisfy 1.3us low pulse width requirement for fast mode
    aRegs->SCLL = ((v / 2) + 8);
    aRegs->SCLH = ((v / 2) - 8);
    } else if (aSpeed == 1000){
    // Set 45%/55% duty cycle to satisfy 0.5us low pulse width requirement for fast mode plus, currently untested
    aRegs->SCLL = ((v / 2) + 3);
    aRegs->SCLH = ((v / 2) - 3);
    } else {
    // Set 50% duty cycle
    aRegs->SCLL = (v / 2);
    aRegs->SCLH = (v / 2);
    }
}

void ILPC17xx_40xx_I2CInit(T_LPC17xx_40xx_I2C_Workspace *p)
{
    // Turn on the power
    LPC17xx_40xxPowerOn(1 << p->iPowerBits);

    // Clear all the flags
    p->iRegs->CONCLR = I2CONSET_AA | I2CONSET_SI | I2CONSET_STA | I2CONSET_I2EN;

    // Program the speed
    ILPC17xx_40xx_I2CSetSpeed(p->iRegs, p->iRequest->iSpeed);

    // Enable the I2C
    I2C_ENABLE(p);
}

static void ILPC17xx_40xx_I2C_StartWrite(
        void *aWorkspace,
        I2C_Request *iRequest,
        void *aCallbackWorkspace,
        I2CRequestCompleteCallback aCallbackFunc)
{
    T_LPC17xx_40xx_I2C_Workspace *p = (T_LPC17xx_40xx_I2C_Workspace *)aWorkspace;

    // Use an address (and make sure the lowest bit is zero)
    p->iRequest = iRequest;
    p->iCompleteFunc = aCallbackFunc;
    p->iCompleteWorkspace = aCallbackWorkspace;
    p->iAddress = (p->iRequest->iAddr << 1) | I2C_MODE_WRITE;
    p->iData = (TUInt8 *)p->iRequest->iWriteData;
    p->iDataLen = p->iRequest->iWriteLength;
    p->iIndex = 0;
    p->iDoneFlag = EFalse;
    p->iRequest->iStatus = I2C_BUSY;

    // Initialize the I2C
    ILPC17xx_40xx_I2CInit(p);

    // Kick off the transfer with a start bit
    STA_SET(p);
}

static void ILPC17xx_40xx_I2C_StartRead(
        void *aWorkspace,
        I2C_Request *iRequest,
        void *aCallbackWorkspace,
        I2CRequestCompleteCallback aCallbackFunc)
{
    T_LPC17xx_40xx_I2C_Workspace *p = (T_LPC17xx_40xx_I2C_Workspace *)aWorkspace;

    // Use an address (and make sure the lowest bit is zero)
    p->iRequest = iRequest;
    p->iCompleteFunc = aCallbackFunc;
    p->iCompleteWorkspace = aCallbackWorkspace;
    p->iAddress = (p->iRequest->iAddr << 1) | I2C_MODE_READ;
    p->iData = p->iRequest->iReadData;
    p->iDataLen = p->iRequest->iReadLength;
    p->iIndex = 0;
    p->iDoneFlag = EFalse;
    p->iRequest->iStatus = I2C_BUSY;

    // Initialize the I2C
    ILPC17xx_40xx_I2CInit(p);

    // Kick off the transfer with a start bit
    STA_SET(p);
}

/*-------------------------------------------------------------------------*
 * Routine:  ILPC17xx_40xx_ProcessState
 *-------------------------------------------------------------------------*
 * Description:
 *      Core I2C processing (typically done in interrupt routine)
 *-------------------------------------------------------------------------*/
void ILPC17xx_40xx_ProcessState(T_LPC17xx_40xx_I2C_Workspace *p)
{
    TUInt8 c;
    TUInt8 status = p->iRegs->STAT;

    //SerialSendChar(SERIAL_PORT_UART0, '$');
    //SerialSendHex(SERIAL_PORT_UART0, status);
    //ConsolePrintf("$%02X", status);
    switch (status) {
#if (COMPILE_I2C_MASTER_MODE == 1)
        // Start condition tranmitted
        case 0x08:

            // Repeat start condition transmitted
        case 0x10:
            // Send the slave address
            I2DAT_WRITE(p, p->iAddress);
            //            (((p)->iRegs)->DAT) = (p->iAddress);
            STA_CLEAR(p);
            STO_CLEAR(p);
            p->iIndex = 0;
            break;

            // MASTER TRANSMITTER
            // Slave Address + Write transmitted, and got ACK from slave
        case 0x18:
            // Transmit a byte
            I2DAT_WRITE(p, p->iData[p->iIndex]);
            STA_CLEAR(p);
            STO_CLEAR(p);
            break;

            // Slave Address transmitted, no ACK received
        case 0x20:
            // Generate a stop condition and report error status
            STA_CLEAR(p);
            STO_SET(p);
            p->iRequest->iStatus = I2C_ERROR;
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;

            // Data byte written and ACK received.
        case 0x28:
            // Last byte?
            p->iIndex++;
            if (p->iIndex >= p->iDataLen) {
                // Yes, last.  Generate a stop condition
                STA_CLEAR(p);
                STO_SET(p);
                p->iRequest->iStatus = I2C_OK;
                p->iDoneFlag = ETrue;
                p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            } else {
                // Send the next byte
                I2DAT_WRITE(p, p->iData[p->iIndex]);
                STA_CLEAR(p);
                STO_CLEAR(p);
            }
            break;

            // Data byte written but no ACK received
        case 0x30:
            // Generate a stop condition
            STA_CLEAR(p);
            STO_SET(p);
            p->iRequest->iStatus = I2C_ERROR;
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;

